#include <bits/stdc++.h>
using namespace std;
int main()
{
    int x[5], y[5];
    for(int i=1; i<=4; i++)
        cin>>x[i]>>y[i];
    //·ÖÀàÌÖÂÛ
    if(x[4]>=x[2] && x[3]<=x[1] && y[4]>=y[2] && y[3]<=y[1])
        cout<<0;//ÍêÈ«¸²¸Ç
    else if(x[3]<=x[1] && y[3]<=y[1] && y[4]>y[1] && x[4]>=x[2])
        cout<<(x[2]-x[1])*(y[2]-y[4]);//ÉÏ·½Î´¸²¸Ç
    else if(y[3]<y[2] && x[3]<=x[1] && y[4]>=y[2] && x[4]>=x[2])
        cout<<(x[2]-x[1])*(y[3]-y[1]);//ÏÂ·½Î´¸²¸Ç
    else if(x[4]>x[1] && x[3]<=x[1] && y[4]>=y[2] && y[3]<=y[1])
        cout<<(x[2]-x[4])*(y[2]-y[1]);//ÓÒ²àÎ´¸²¸Ç
    else if(x[3]<x[2] && x[4]>=x[2] && y[4]>=y[2] && y[3]<=y[1])
        cout<<(x[3]-x[1])*(y[2]-y[1]);//×ó²àÎ´¸²¸Ç
    else cout<<(x[2]-x[1])*(y[2]-y[1]);//ÍêÈ«Î´¸²¸Ç ÒÔ¼°Ö»¸²¸Ç±ß½Ç
    return 0;
}
 
